{
    "abilities": {
        "pretense": "[b]Hungry Game[/b]: Gives you a list of abilities or info about a specific ability.",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!abilities [ability name][/b]",
                    "[sup]All parameters are [b]optional[/b][/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]\"!abilities\"[/b]",
                    "[sup]Get a list of available abilities[/sup]",
                    "[b]\"!abilities attack\"[/b]",
                    "[sup]Check out info about the \"attack\" ability[/sup]"
                ]
            }
        ]
    },
    "perks": {
        "pretense": "[b]Hungry Game[/b]: Gives you a list of perks or info about a specific perk.",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!perks [perk name][/b]",
                    "[sup]All parameters are [b]optional[/b][/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]\"!perks\"[/b]",
                    "[sup]Get a list of available perks[/sup]",
                    "[b]\"!perks veteran\"[/b]",
                    "[sup]Check out info about the veteran perk[/sup]"
                ]
            }
        ]
    },
    "hungry": {
        "pretense": "[b]Hungry Game[/b]: A brief explainer of the game mechanics:",
        "subtext": [
            "Think of [b]Hungry Game[/b] as a RPG-lite focused around vore, though it can easily be utilized for general fighting scenes similarly. If there is adequate desire to generalize it, I'd be more than happy to adjust [b]Hungry Game[/b] to encompass that.\n\n[b]Hungry Game[/b] is meant to not be a game in and of itself, but rather a supporting asset to control the flow of an RP. Sometimes you are surprised and things don't go your way. Inversely there are times where things go unexpectedly well! The sky is the limit really! This is just a fancy dice game without the pain of having to explain the rules to everyone in the party, and how to handle rolling. [b]Hungry Game[/b] looks to trivialize this experience and allow more people the ability to get into incorporating external systems into their RP.\n\n[b]Stats:[/b]\n[i]Stats are exactly what they say on the tin below. Stats are a very generic way of making your character stronger. They do not progress linearly like a lot of RPGs, but rather they unlock certain bonuses in multiple different level intervals. This means stat milestones come with very large bonuses that you can [b]really feel[/b]! Rather than a slow and steady progression that feels unrewarding.[/i]\n\n   [b]Strength:[/b]\n       [i]Base attack roll: 1d8 + 0[/i]\n       Every 4 levels of strength gives +2 to die faces. Example: 1d8 -> 1d10.\n       Every 10 levels of strength gives +3 to your damage modifier. Example: 1d8 + 0 -> 1d8 + 3.\n   [b]Agility:[/b]\n       [i]Base crit chance is 10%, crit adds +1 die to a roll. Base evasion is 0%. Evading an attack negates all incoming damage[/i].\n       Every 5 levels of agility gives +12.5% crit chance. Crit does indeed stack well above 100%. :)\n       Every 10 levels of agility increases evasion chance by %6.\n       Every 15 levels of agility gives you +1 die to your attack rolls.\n   [b]Vitality:[/b]\n       [i]Base HP/Stamina is 100, base damage reduction is 0 and base damage buffer is also 0.[/i]\n       Every 5 levels of vitality causes you to gain an extra +3 damage buffer that resets per round. Example: You have two incoming attacks for 2 damage, but you have 3 damage buffer. You take a total of 1 damage, as 3 was absorbed by your buffer.\n       Every 5 levels of vit also nets you +15 HP/+5 stamina.\n       Every 10 levels of vit adds +2 damage reduction to your character. Example: Just like before, 2x2 damage attacks are incoming, but your 2 damage reduction causes you to take [b]no damage[/b]. This is particularly useful in [b]Hungry Game[/b] because the game allows numerous people to fight at once. At the moment the limit is 1 pred vs 1-5 prey.\n\n   [b]Perks/Abilities/Status Effects:[/b]\n       Perks and abilities can be gained both by spending their respective points you earn upon character progression (leveling).\n       Every 2 levels gives you 1 perk point, every 4 levels nets you an ability point.\n       You gain levels by winning in combat, however it's not an  EXP system like most RPGs. Winning as pred nets you 1 level; However, losing as pred loses you 2 levels. Winning as prey nets you 2 levels, and you only lose 1 level for a loss. Prey are naturally at a disadvantage in this game and suffer a status effect that causes them to only act at 60% efficiency. This means an equal-level predator against a single prey has a very, very high chance at winning.\n       You can find out more about perks and abilities by using the \"[i]!perks[/i]\" and \"[i]!abilities[/i]\" commands respectively.\n       Some perks are unable to be purchased via the \"[i]!buy[/i]\" command, but require your character to progress to milestones or acheivements. For instance: a level of the \"raid boss\" perk is gained each time you defeat 5 prey as a single pred in a 1v5 game. These bonuses are often rather substantial given the luck necessary in order to earn them. Hidden/Acheivement perks also give you \"badges\". Badges show up next to your character name within the [b]Hungry Game[/b] and you can set which badge you want to display with \"[i]!badge[/i]\" command. All badge unlocks will show up under your character \"[i]!sheet[/i]\".\n\n\"[i]!sheet[/i]\" is a very important command to show you your character progression, current stat points/perk points/ability points that you currently can spend.\n\nWell, that about sums it up, hope you enjoy the game!\n\nIf you have anymore questions or concerns, please contact [user]Kali[/user], the developer/creator of this game and bot!"
        ]
    },
    "create": {
        "pretense": "[b]Hungry Game[/b]: A command to begin to character creation process."
    },
    "refund": {
        "pretense": "[b]Hungry Game[/b]: Refund all spent stat points and all spent ability/perk points. Requires confirmation."
    },
    "sheet": {
        "pretense": "[b]Hungry Game[/b]: A command to grab the character sheet of yourself, or a different character.",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!sheet [character][/b]",
                    "[sup]All parameters are [b]optional[/b][/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]\"!sheet\"[/b]",
                    "[sup]Prints our your character sheet[/sup]",
                    "[b]\"[i]!sheet Kali\"[/b]",
                    "[sup]Prints out \"Kali\"'s character sheet[/sup]"
                ]
            }
        ]
    },
    "buy": {
        "pretense": "[b]Hungry Game[/b]: A command to spend [i]perk points[/i], [i]ability points[/i] and [i]stat points[/i].",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!buy [perk or stat or ability] [number] [name][/b]",
                    "[sup][b][number][/b] is optional, defaults to 1[/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]\"!buy perk 4 rage-fueled\"[/b]",
                    "[sup]Buy [b]4[/b] levels of a [b]perk[/b] called [b]rage-fueled[/b][/sup]",
                    "[b]\"!buy stat 10 strength\"[/b]",
                    "[sup]Buy [b]10 points[/b] of the [b]strength[/b] [b]stat[/b][/sup]",
                    "[b]\"!buy ability heal\"[/b]",
                    "[sup]Buy [b]1[/b] level of the [b]heal[/b] [b]ability[/b][/sup]"
                ]
            }
        ]
    },
    "challenge": {
        "pretense": "[b]Hungry Game[/b]: The command to \"throw down the gauntlet\" as it were! Be it to one, or up to five potentially unlucky prey! This command will request all the parties to consent to the challenge, and will begin the game if all accept. Keep in mind that these parties must have already created a [b]Hungry Game[/b] character.",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!challenge [character1], ..., [character5][/b]",
                    "[sup][b][character2-5][/b] are optional[/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]\"!challenge Kali\"[/b]",
                    "[sup]Challenges \"Kali\", with the challenger taking on the pred role and \"Kali\" taking on the prey role[/sup]",
                    "[b]\"!challenge Kali, Kali2, Kali3, Kali4, Kali5\"[/b]",
                    "[sup]Challenges all five participants into a single 1v5 fight[/sup]"
                ]
            }
        ]
    },
    "target": {
        "pretense": "[b]Hungry Game[/b]: Target a person during an active game with an ability, mostly useful when your abilities have a specific target in mind.",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!target [character], [ability][/b]",
                    "[sup]All parameters are [b]required[/b][/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]\"!target kali, heal\"[/b]",
                    "[sup]Targets \"Kali\" and sets your turn for this round to heal \"Kali\"[/sup]"
                ]
            }
        ]
    },
    "action": {
        "pretense": "[b]Hungry Game[/b]: This command allows you to choose an ability to use during this round, one that doesn't require specific targets in mind.",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!action [ability][/b]",
                    "[sup]All parameters are [b]required[/b][/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]\"!action attack\"[/b]",
                    "[sup]Sets your character to \"attack\" on this round, and you will perform a damage roll against a group of prey (preds do exclusiveely cleave/AOE damage), or a pred[/sup]"
                ]
            }
        ]
    },
    "badge": {
        "pretense": "[b]Hungry Game[/b]: Apply one of your badges to be the default badge shown next to your name in the UI. Badges are unlocked when you unlock \"Milestone Perks\"!",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!badge [perk][/b]",
                    "[sup]All parameters are [b]required[/b][/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]\"!badge raid boss\"[/b]",
                    "[sup]Sets your default badge to the badge given by the \"raid boss\" acheivement perk[/sup]"
                ]
            }
        ]
    },
    "logs": {
        "pretense": "A log of moderation actions that the bot has taken."
    },
    "yeetus": {
        "pretense": "Gotta protect the kids from themselves. :>~"
    },
    "eicon": {
        "pretense": "Search the current database of known eicons.",
        "subtext": [
            {
                "name":"Syntax",
                "subtext": [
                    "[b]!eicon [-flag] [page number] [gif or png] [search pattern][/b]",
                    "[sup]All parameters are [b]optional[/b][/sup]"
                ]
            },
            {
                "name":"Usage",
                "subtext": [
                    "[b]!eicon -r 2 gif kali[/b]",
                    "[sup]This is a search that requests \"page 2\" of \"animated eicons\" with the search phrase \"kali\" and sorted in reverse (-r flag)[/sup]"
                ]
            },
            {
                "name":"Flags",
                "subtext": [
                    "[b]r:[/b]\n      [sup]Reversed order[/sup]",
                    "[b]t:[/b]\n      [sup]Ordered by most recently verified icons. \"Verified\" means that the icon has been verified to not have been deleted since it was initially stored within the database[/sup]"
                ]
            },
            {
                "name":"Notes",
                "subtext": [
                    "The max results per page is 2000. Multiple flags can be used at the same time, such as \"-rt\".\n   By default, the sorting is done by popularity with a secondary alphabetical sort. This is the same sorting algorithm that the database uses."
                ]
            }
        ]
    }
}